{
  "document": "use_supras_vrf",
  "chunks": [
    {
      "id": "use_supras_vrf.mdx_chunk_0",
      "content": "***\n\nid: 'supras-vrf'\ntitle: 'Supra, VRF'\ndescription: 'Learn how to use Supra VRF'\nauthor: ksdumont\nsme: ksdumont\nsidebar\\_label: 'How to use Supra VRF'\n--------------------------------------\n\n:::info Community member contribution\n\nShoutout to [@ksdumont](https://github.com/ksdumont) for contributing the following [third-party document](/for-devs/third-party-docs/contribute)! :::\n\nSupra’s VRF can provide the exact properties required for a random number generator (RNG) to be fair with tamper-proof, unbiased, and cryptographically verifiable random numbers to be employed by smart contracts. Integrating with Supras' VRF is quick and easy. Supra currently supports several Solidity/EVM-based networks, like Arbitrum, and non-EVM networks like Sui, Aptos. To get started, you will want to visit [Supras' docs site](https://supraoracles.com/docs/vrf) and review the documentation or continue to follow this guide for a quick start. Latest version of Supra VRF requires a customer controlled wallet address to act as the main reference for access permissions and call back(response) transaction gas fee payments."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_1",
      "content": "Therefore, users planning to consume Supra VRF should get in touch with our team to get your wallet registered with Supra. Once your wallet is registered by the Supra team, you could use it to whitelist any number of VRF requester smart contracts and pre-pay/top up the deposit balance maintained with Supra in order to pay for the gas fees of callback(response) transactions. You will be interacting with two main contracts:\n\n* **Supra Deposit Contract:** To whitelist smart contracts under the registered wallet address, pre-pay/top up the callback gas fee deposit maintained with Supra. * **Supra Router Contract:** To request and receive random numbers. ## Step 1: Create the Supra router contract interface​\n\nAdd the following code to the requester contract i.e, the contract which uses VRF as a service. You can also add the code in a separate interface and inherit the interface in the requester contract."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_2",
      "content": "```\ninterface ISupraRouterContract {\n\tfunction generateRequest(string memory _functionSig, uint8 _rngCount, uint256 _numConfirmations, uint256 _clientSeed, address _clientWalletAddress) external returns(uint256);\n\tfunction generateRequest(string memory _functionSig, uint8 _rngCount, uint256 _numConfirmations, address _clientWalletAddress) external returns(uint256);\n}\n```\n\nThis interface will help the requester contract interact with the Supra router contract and through which the requester contract can use the VRF service. ## Step 2: Configure the Supra router contract address​\n\nContracts that need random numbers should utilize the Supra router contract. In order to do that, they need to create an interface and bind it to the on-chain address of the Supra router contract. ```\ncontract ExampleContract {\n    ISupraRouter internal supraRouter;\n\n    constructor(address routerAddress) {\n        supraRouter = ISupraRouter(0x7d86fbfc0701d0bf273fd550eb65be1002ed304e);\n    }\n}\n```\n\n## Step 3: Use the VRF service and request a random number​\n\nIn this step, we will use the “generateRequest” function of the Supra Router Contract to create a request for random numbers."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_3",
      "content": "There are two modes for the \"generateRequest\" function. The only difference between them is that you can optionally provide a client-side input, which will also be part of the payload being threshold signed to provide randomness. \\_functionSig- a string parameter, here the requester contract will have to pass the function signature which will receive the callback i.e., a random number from the Supra Router Contract. The function signature should be in the form of the function name following the parameters it accepts. We will see an example later in the document. \\_rngCount - an integer parameter, it is for the number of random numbers a particular requester wants to generate. Currently, we can generate a maximum of 255 random numbers per request. \\_numConfirmations - an integer parameter that specifies the number of block confirmations needed before supra VRF can generate the random number. \\_clientSeed (optional) - an optional integer parameter that could be provided by the client (defaults to 0). This is for additional unpredictability. The source of the seed can be a UUID of 256 bits. This can also be from a centralized source."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_4",
      "content": "\\_clientWalletAddress - an “address” type parameter, which takes the client wallet address which is already registered with the Supra Team, as input. Supra's VRF process requires splitting the contract logic into two functions."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_5",
      "content": "The request function - the signature of this function is up to the developer\nThe callback function - the signature must be of the form “uint256 nonce, uint256\\[] calldata rngList”\n\n```\nfunction exampleRNG() external {\n     //Function validation and logic\n     // requesting 10 random numbers\n     uint8 rngCount = 10;\n\n     // we want to wait for 1 confirmation before the request is considered complete/final\n     uint256 numConfirmations = 1;\n\taddress _clientWalletAddress = //Add the whitelisted wallet address here\n     uint256 generated_nonce = supraRouter.generateRequest(“exampleCallback(uint256,uint256[])”, rngCount, numConfirmations, _clientWalletAddress);\n\n     // store generated_nonce if necessary (eg: in a hashmap)\n     // this can be used to track parameters related to the request, such as user address, nft address etc in a lookup table\n     // these can be accessed inside the callback since the response from supra will include the nonce\n}\n```\n\n## Step 4 - Add the validation in the callback function of requester contract​\n\nInside the callback function where the requester contract wants the random number (in this example the callback function is exampleCallback), the requester contract will have to add the validation such that only the Supra router contract can call the function."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_6",
      "content": "The validation is necessary to protect against malicious contracts/users executing the callback with fake data. For example, if the callback function is pickWinner in the requester contract, the snippet can be as follows. ```\nfunction exampleCallback(uint256 _nonce ,uint256[] _rngList) external {\n    require(msg.sender == address(SupraRouter));\n    // Following the required logic of the function\n }\n```\n\n## Step 5 : Whitelist your requester contract with Supra deposit contract and deposit funds​\n\nIt is important to note that your wallet address must be registered with Supra before this step. If that is completed, then you need to whitelist your requester smart contract under your wallet address and deposit funds to be paid for your call back transactions gas fees. The simplest way to interact with the deposit contract will be through Remix IDE."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_7",
      "content": "Go to Remix IDE & create a file with name IDepositContract.sol\nPaste the following code in the file:\n\n```\ninterface IDepositUserContract {\n\tfunction depositFundClient() external payable;\n\tfunction addContractToWhitelist(address _contractAddress) external;\n\tfunction removeContractFromWhitelist(address _contractAddress) external;\n\tfunction setMinBalanceClient(uint256 _limit) external;\n\tfunction withdrawFundClient(uint256 _amount) external;\n\tfunction checkClientFund(address _clientAddress) external view returns (uint256);\n\tfunction checkEffectiveBalance(address _clientAddress) external view returns (uint256);\n\tfunction checkMinBalanceSupra() external view returns (uint256);\n\tfunction checkMinBalance(address _clientAddress) external view returns(uint256);\n\tfunction countTotalWhitelistedContractByClient(address _clientAddress) external view returns (uint256);\n\tfunction getSubscriptionInfoByClient(address _clientAddress) external view returns (uint256, uint256, bool);\n\tfunction isMinimumBalanceReached(address _clientAddress) external view returns (bool);\n\tfunction listAllWhitelistedContractByClient(address _clientAddress) external view returns (address[] memory);\n\n}\n```\n\nNavigate to the “Navigate & run Transactions” tab in remix, and paste the deposit contract address into the text box besides the “At Address” button & press the at address button."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_8",
      "content": "You will find the instance for the deposit contract created using which a user can interact and use the features provided by the deposit contract. Following functions will facilitate whitelisting your requester smart contracts and fund deposits. “addContracttoWhitelist(address)” - The whitelisted users will have to whitelist their contract which they will be using to request for random numbers. The parameter this function takes is the User’s contract address. This function will be called after the user deploys the requester contract post development and makes it ready for interacting with the Supra Contracts. “depositFundClient()” - is another mandatory function for a user to use once, before the user starts requesting from that contract. This is a function which will deposit funds in the deposit contract from the users for the response/callback transaction."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_9",
      "content": "The funds for a specific user should remain higher than the minimum amount set by the Supra( 0.1 Eth for Arbitrum testnet) for the new request transactions to be accepted.\\\nBasically the gist here is that the user will have to interact with the Deposit contract and add funds for their accounts, which will be utilized for the response transaction gas fee. There will be a script from Supra which will be monitoring the funds and will alert the user if a refill is required."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_10",
      "content": "## Example implementation\n\n```\n// SPDX-License-Identifier: MIT\npragma solidity ^0.8.0;\ninterface ISupraRouter {\n   function generateRequest(string memory _functionSig , uint8 _rngCount, uint256 _numConfirmations, uint256 _clientSeed,address _clientWalletAddress) external returns(uint256);\n   function generateRequest(string memory _functionSig , uint8 _rngCount, uint256 _numConfirmations,address _clientWalletAddress) external returns(uint256);\n}\ncontract Interaction {\n   address supraAddr;\n   constructor(address supraSC) {\n       supraAddr = supraSC;\n   }\n   mapping (uint256 => string ) result;\n   mapping (string => uint256[] ) rngForUser;\n   function getRNGForUser(uint8 rngCount, string memory username) external {\n      uint256 nonce =  ISupraRouter(supraAddr).generateRequest(\"myCallbackUsername(uint256,uint256[])\", rngCount, 1, 123, msg.sender);\n//Can pass \"msg.sender\" when calling from the whitelisted wallet address\n      result[nonce] = username;\n   }\n   function myCallbackUsername(uint256 nonce, uint256[] calldata rngList) external {\n      require(msg.sender == supraAddr, \"only supra router can call this function\");\n      uint8 i = 0;\n      uint256[] memory x = new uint256[](rngList.length);\n      rngForUser[result[nonce]] = x;\n      for(i=0; i<rngList.length;i++){\n         rngForUser[result[nonce]][i] = rngList[i] % 100;\n      }\n   }\n   function viewUserName(string memory username) external view returns (uint256[] memory) {\n      return rngForUser[username];\n   }\n   }\n```\n\n## Going further with Supra\n\nIf you want to take the next step, consider registering for the [Supra Network Activate Program (SNAP)](https://join.supraoracles.com/network-activate-program)."
    },
    {
      "id": "use_supras_vrf.mdx_chunk_11",
      "content": "The Supra Network Activate Program (SNAP) offers companies discounted oracle credits, technical documentation, and customer support to embed much-needed oracles and VRF/RNG. SNAP supports Web3 scaling and growth to buffer costs which could typically inhibit a company’s success. The SNAP program is partnered with some of Web3's most prolific names who are helping with project selection and qualification. ## Connect with us! Still looking for answers? We got them! Check out all the ways you can reach us:\n\n* Visit us at [supraoracles.com](https://supraoracles.com)\n* Read our [Docs](https://supraoracles.com/docs/overview)\n* Chat with us on [Telegram](https://t.me/SupraOracles)\n* Follow us on [Twitter](https://twitter.com/SupraOracles)\n* Join our [Discord](https://discord.gg/supraoracles)\n* Check us out on [Youtube](https://www.youtube.com/SupraOfficial)"
    }
  ]
}